tutorials/cases/charOnlyMoveCases/serial_inet/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|rhoFinal)"
    {
        solver          diagonal;
    }
    p
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-12;
        relTol           0;

//        solver          GAMG;
//        tolerance       1e-06;
//        relTol          0.01;
//        smoother        GaussSeidel;
//        cacheAgglomeration true;
//        nCellsInCoarsestLevel 10;
//        agglomerator    faceAreaPair;
//        mergeLevels     1;
    }
    pFinal
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-12;
        relTol           0;

//        solver          GAMG;
//        tolerance       1e-06;
//        relTol          0;
//        smoother        GaussSeidel;
//        cacheAgglomeration true;
//        nCellsInCoarsestLevel 10;
//        agglomerator    faceAreaPair;
//        mergeLevels     1;
    }
    "(U|h|Yi|Ys|porosity|Ym)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-12;
        relTol          1e-7;
    }
    
    "(U|h|Yi|Ys|porosity)Final"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-12;
        relTol          1e-7;
    }
    solidH
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-12;
        relTol           1e-7;
    }
    Ts
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-12;
        relTol           1e-7;
    }
    rhos
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-50;
        relTol          1e-50;
    }
    G
    {
        $p;
        tolerance       1e-05;
        relTol          1e-2;
    }

    GFinal
    {
        $G;
        relTol          0;
    }
}


PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors  2;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    maxDeltaT	1e-3;
}


relaxationFactors
{
    equations
    {
        U   1;
        Ufinal 1;
        h  1;
        hFinal  1;
        Yi  1;
        YiFinal 1;
    }
}

// *************************************************************************//

